In [113]:
import numpy as np
import pandas as pd

df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['one','two','one','two','one'],
                   'data1':np.random.randint(1,11,size=5),
                   'data2':np.random.randint(1,11,size=5)})
df

  key1 key2  data1  data2
0    a  one      6     10
1    a  two      5      5
2    b  one     10      3
3    b  two      4      3
4    a  one      9     10

In [114]:
df.groupby(by=['key1','key2'])['data1'].sum()

key1  key2
a     one     15
      two      5
b     one     10
      two      4
Name: data1, dtype: int64

In [115]:
df.groupby(by=['key1','key2'])[['data1','data2']].sum()

           data1  data2
key1 key2
a    one      15     20
     two       5      5
b    one      10      3
     two       4      3

In [116]:
df.groupby(by=['key1','key2']).sum()

           data1  data2
key1 key2
a    one      15     20
     two       5      5
b    one      10      3
     two       4      3